* BOOST 36V 3A CON MICRO stm32f030K6T6
** Principio de funcionamiento
   - Funcionan con 2 mosfets sincronizados TIM1 -> TIM3
   - CTRL_Q2 (PA8 TIM1 CH1)
   - CTRL_Q1 (PA6 TIM3 CH1)
   - Ademas uso el LED en (PA10 TIM1 CH3) si selecciono USE_LED_AS_TIM1_CH3

** Terminar en el firmware [6/6]
   - [X] Corregir configuracion de INT
   - [X] Activar bien INT
   - [X] Revisar signals pwm en synchro
   - [X] Mediciones ADC
   - [X] ADC synchro con pwm tim1 o tim3
   - [X] pasar rutinas dsp a modelos nuevos
   
** Arranque Hardware
*** ADC + DMA + TIM
**** Tiempo teorico de conversion ADC con DMA
     - tiempo de conversion por canal 12bits (sample_time + 12.5) * tick
     - tiempo de conversion por canal 10bits (sample_time + 10.5) * tick
     - tiempo de conversion por canal 8bits (sample_time + 8.5) * tick

       | Resolution | Sample Time[samples] | Channels | Clk Freq [MHz] | Time to end [us] |
       |------------+----------------------+----------+----------------+------------------|
       |         10 |                 71.5 |        5 |             12 |        34.166667 |
       |            |                      |          |                |                  |
       #+TBLFM: @2$5=((@2$1+0.5+@2$2)*@2$3/@2$4)

**** Tiempo teorico de toma de resultados
     - Los resultados (valores ADC) no los tomo justo en el tiempo de conversion,
       sino como multiplo del timer que dispara las conversiones
     - Este tiempo "real" de muestreo es el minimo multiplo del timer que supera al 
       tiempo del ADC
     
     - min(Ttim * n) > Tadc

    | freq TIM3 | Ttim[us] | Tadc [us] | Multiplo | T seq_ready [us] | F seq_ready [KHz] |
    |-----------+----------+-----------+----------+------------------+-------------------|
    | 48KHz     |    20.83 |     34.16 |        2 |            41.66 |         24.003841 |
    | 70KHz     |    14.28 |     34.16 |        3 |            42.84 |         23.342670 |
    |           |          |           |          |                  |                   |
    #+TBLFM: @2$6=1000/@2$5::@3$5=(@3$2*@3$4)::@2$5=(@2$2*@2$4)

**** Medicion de tiempo del DMA para el ADC
    - con 70KHz en TIM3 termina justo en la mitad de un ciclo
    - con 48KHz en TIM3 termina 1/3 antes del nuevo pulso

    | freq TIM3 | freq seq_ready | T end of conversion |
    |-----------+----------------+---------------------|
    | 48KHz     | 24.0KHz        | 41.6us              |
    | 70KHz     | 23.6KHz        | 42.4us              |
    |           |                |                     |






* Mediciones 19-09-2019
** Sensado de Tensiones vistos por el micro
   - sacando pwm por el led

     | Resolution | Sample Time[samples] | Channels | Clk Freq [MHz] |
     |------------+----------------------+----------+----------------|
     |         10 |                 71.5 |        3 |             12 |

     | Sensed Channel | Active Time [us] | Total Time [us] |  Pts meas | Applied Voltage | Relation [pts/V] |
     |----------------+------------------+-----------------+-----------+-----------------+------------------|
     | Sense_BAT      |              9.2 |              21 | 438.09524 |           12.63 |        34.686876 |
     | Sense_BOOST    |             17.6 |              21 | 838.09524 |            34.7 |        24.152601 |
     | Sense_PWR_36V  |             17.6 |              21 | 838.09524 |            34.7 |        24.152601 |

     #+TBLFM: @2$4=(@2$2/@2$3)*1000::@2$6=(@2$4/@2$5)::@3$4=(@3$2/@3$3)*1000::@3$6=(@3$4/@3$5)::@4$4=(@4$2/@4$3)*1000::@4$6=(@4$4/@4$5)

** Salida para desconexion
   - mandar 3.3V al pwm para apagar

** Sensado de tension V

   | VPOS  | Vup (R30) |
   |-------+-----------|
   | 34.8V | 1.68V     |
   | 30V   | 1.4V      |
   | 24V   | 0.88V     |

** Sensado de corriente Rsense

   | IOUT  | Iup (R17) |
   |-------+-----------|
   | 2.38A | 1.56V     |

** Sensado de 220Vac - V220_sense

   | Vin acrms | V220_sense | Comments.                                |
   |-----------+------------+------------------------------------------|
   | 220Vac    | 2.52V 50Hz | mucho ruido, es una senoidal rectificada |
   |           |            |                                          |

** Isense del mosfet
   - 4 R 1ohm SMD en //

   | Salida    | V(I_sense)                                |
   |-----------+-------------------------------------------|
   | 30V 2.38A | 260mV; 480mV (trapecio); Ton 6us T 15.6us |
   
** Tiempo de vuelta Voltage Mode - 30-7-19
   - tiempo de proceso luego de sequence_ready (boost mode): 
     sin generar tipico 5.04us, cada tanto 6.96us
     generando tipico 7.6us 11.8us cada tanto

   - las secuencias largas debe ser por el modo undersampling
